aw101/openfoam/case/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform $turbulentVisc;

boundaryField
{
    inlet
    {
        type        calculated;
        value       $internalField;
    }

    outlet
    {
        type        calculated;
        value       $internalField;
    }
    
    sym
    {
        type        symmetryPlane;
    }

    walls
    {
        type        calculated;
        value       $internalField;
    }

    model
    {
        type        nutkWallFunction;
        value       $internalField;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
