aw101/openfoam/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       simpleFoam;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           300;

deltaT            1;

writeControl      timeStep;

writeInterval     1;

purgeWrite        1;

writeFormat       binary;

writePrecision    6;

writeCompression  uncompressed;

timeFormat        general;

timePrecision     6;

runTimeModifiable true;

functions
{
    #include "forceCoeffs"
}

// ************************************************************************* //
